HexHive/privacyshield/relay-fw/src/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.2.0 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32c3"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=y
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
CONFIG_PARTITION_TABLE_MD5=n
CONFIG_HTTP_BUFFER_SIZE=4096
CONFIG_VALID_TAGS_ONLY=y
CONFIG_ROTATE_TAGS=y
CONFIG_BLE_ADVERTISEMENT_INTERVAL=500
CONFIG_BLE_ADVERTISEMENT_DURATION=2000
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_STACK_CHECK_MODE_ALL=y
CONFIG_BT_ENABLED=y
CONFIG_BT_GATTS_ENABLE=n
CONFIG_BT_GATTC_ENABLE=n
CONFIG_BT_BLE_SMP_ENABLE=n
CONFIG_BT_MULTI_CONNECTION_ENBALE=n
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y
CONFIG_BT_BLE_HIGH_DUTY_ADV_INTERVAL=y
CONFIG_BT_CTRL_DFT_TX_POWER_LEVEL_P21=y
CONFIG_BT_CTRL_COEX_PHY_CODED_TX_RX_TLIM_EN=y
CONFIG_ETH_USE_SPI_ETHERNET=n
CONFIG_ESP_PHY_CALIBRATION_AND_DATA_STORAGE=n
CONFIG_ESP_SYSTEM_PANIC_REBOOT_DELAY_SECONDS=1
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_WIFI_NVS_ENABLED=n
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=n
CONFIG_MBEDTLS_ECP_RESTARTABLE=y
